First_Routes/app/controllers/users_controller.rb

  def update
    user = User.find_by(id: params[:id])
    if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "username" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["username", "La1993"], ["updated_at", "2018-09-11 00:16:45.972026"], ["id", 4]]

  def destroy
    user = User.find_by(id: params[:id])
    if user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]